In [31]:
import pandas as pd
import os
import numpy as np
import glob
import pyodbc

In [5]:
filename=os.getcwd()

In [5]:
filename

'C:\\Users\\j\\Desktop\\Project'

In [6]:
ecom_csv_files = glob.glob(os.path.join(filename,'*.csv'))
ecom_csv_files

['C:\\Users\\j\\Desktop\\Project\\employees.csv',
 'C:\\Users\\j\\Desktop\\Project\\revenue.csv',
 'C:\\Users\\j\\Desktop\\Project\\Superstore.csv',
 'C:\\Users\\j\\Desktop\\Project\\Superstore1.csv',
 'C:\\Users\\j\\Desktop\\Project\\Superstore2.csv']

In [7]:
data=pd.read_csv('C:\\Users\\j\\Desktop\\Project\\employees.csv')

In [14]:
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [16]:
data.shape

(1000, 8)

In [17]:
data.head

<bound method NDFrame.head of     First Name  Gender  Start Date Last Login Time  Salary  Bonus %  \
0      Douglas    Male    8/6/1993        12:42 PM   97308    6.945
1       Thomas    Male   3/31/1996         6:53 AM   61933    4.170
2        Maria  Female   4/23/1993        11:17 AM  130590   11.858
3        Jerry    Male    3/4/2005         1:00 PM  138705    9.340
4        Larry    Male   1/24/1998         4:47 PM  101004    1.389
..         ...     ...         ...             ...     ...      ...
995      Henry     NaN  11/23/2014         6:09 AM  132483   16.655
996    Phillip    Male   1/31/1984         6:30 AM   42392   19.675
997    Russell    Male   5/20/2013        12:39 PM   96914    1.421
998      Larry    Male   4/20/2013         4:45 PM   60500   11.985
999     Albert    Male   5/15/2012         6:24 PM  129949   10.169

    Senior Management                  Team
0                True             Marketing
1                True                   NaN
2               False               Finance
3                True               Finance
4                True       Client Services
..                ...                   ...
995             False          Distribution
996             False               Finance
997             False               Product
998             False  Business Development
999              True                 Sales

[1000 rows x 8 columns]>

In [21]:
for i in ecom_csv_files:
    df=pd.DataFrame()
    
    print(i)
    df=pd.read_csv(i,encoding='windows-1252')

C:\Users\j\Desktop\Project\employees.csv
C:\Users\j\Desktop\Project\revenue.csv
C:\Users\j\Desktop\Project\Superstore.csv
C:\Users\j\Desktop\Project\Superstore1.csv
C:\Users\j\Desktop\Project\Superstore2.csv

In [22]:
df

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,3001,CA-2014-138317,6/21/2014,6/25/2014,Standard Class,NW-18400,Natalie Webber,Consumer,United States,Philadelphia,...,19120,East,OFF-AP-10003860,Office Supplies,Appliances,Fellowes Advanced 8 Outlet Surge Suppressor wi...,44.416,2,0.2,3.8864
1,3002,CA-2014-138317,6/21/2014,6/25/2014,Standard Class,NW-18400,Natalie Webber,Consumer,United States,Philadelphia,...,19120,East,OFF-BI-10000069,Office Supplies,Binders,"GBC Prepunched Paper, 19-Hole, for Binding Sys...",9.006,2,0.7,-7.2048
2,3003,CA-2015-130610,7/5/2015,7/10/2015,Standard Class,VP-21730,Victor Preis,Home Office,United States,Sterling Heights,...,48310,Central,OFF-BI-10003655,Office Supplies,Binders,Durable Pressboard Binders,19.000,5,0.0,8.9300
3,3004,CA-2017-104381,12/16/2017,12/23/2017,Standard Class,RD-19810,Ross DeVincentis,Home Office,United States,Rochester,...,14609,East,OFF-BI-10001628,Office Supplies,Binders,Acco Data Flex Cable Posts For Top & Bottom Lo...,33.376,4,0.2,10.4300
4,3005,CA-2016-131499,9/8/2016,9/10/2016,First Class,MG-17875,Michael Grace,Home Office,United States,New York City,...,10011,East,OFF-AP-10003779,Office Supplies,Appliances,Kensington 7 Outlet MasterPiece Power Center w...,207.480,1,0.0,62.2440
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4994,7995,US-2015-165743,11/20/2015,11/23/2015,Second Class,MM-18055,Michelle Moray,Consumer,United States,Aurora,...,80013,West,FUR-BO-10002268,Furniture,Bookcases,Sauder Barrister Bookcases,145.764,6,0.7,-247.7988
4995,7996,US-2015-165743,11/20/2015,11/23/2015,Second Class,MM-18055,Michelle Moray,Consumer,United States,Aurora,...,80013,West,OFF-BI-10001758,Office Supplies,Binders,Wilson Jones 14 Line Acrylic Coated Pressboard...,9.612,6,0.7,-7.3692
4996,7997,US-2017-105998,11/3/2017,11/5/2017,First Class,CR-12580,Clay Rozendal,Home Office,United States,San Diego,...,92037,West,TEC-AC-10004469,Technology,Accessories,Microsoft Sculpt Comfort Mouse,199.750,5,0.0,87.8900
4997,7998,US-2017-105998,11/3/2017,11/5/2017,First Class,CR-12580,Clay Rozendal,Home Office,United States,San Diego,...,92037,West,FUR-TA-10001095,Furniture,Tables,Chromcraft Round Conference Tables,1673.184,12,0.2,20.9148
4998,7999,US-2014-148194,5/4/2014,5/7/2014,First Class,BS-11365,Bill Shonely,Corporate,United States,Seattle,...,98105,West,FUR-FU-10001852,Furniture,Furnishings,"Eldon Regeneration Recycled Desk Accessories, ...",12.180,7,0.0,3.8976

In [1]:
!pip install pyodbc

Collecting pyodbc
  Downloading pyodbc-4.0.32-cp39-cp39-win_amd64.whl (72 kB)
Installing collected packages: pyodbc
Successfully installed pyodbc-4.0.32

In [2]:
df.columns

NameError: name 'df' is not defined

In [8]:
data.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [11]:
f_data=data.rename(columns={'First Name':'First_Name',  'Start Date':'Strat_Date', 'Last Login Time':'Last_Login_Time', 
       'Bonus %':'Bonas_%', 'Senior Management':'Senior_Management'})

In [12]:
data.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [15]:
f_data=data[['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary','Bonus %', 'Senior Management', 'Team']]

In [17]:
f_data.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [18]:
f_data.drop_duplicates(keep='first')

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [26]:
f_data=f_data.rename(columns={'First Name':'First_Name',  'Start Date':'Strat_Date', 'Last Login Time':'Last_Login_Time', 
       'Bonus_%':'Bonas', 'Senior Management':'Senior_Management'})

In [29]:
f_data=f_data.rename(columns={'Bonas_%':'Bonas'})

In [30]:
f_data.columns

Index(['First_Name', 'Gender', 'Strat_Date', 'Last_Login_Time', 'Salary',
       'Bonas', 'Senior_Management', 'Team'],
      dtype='object')

In [61]:
f_data[['Bonas','Salary']]

      Bonas  Salary
0     6.945   97308
1     4.170   61933
2    11.858  130590
3     9.340  138705
4     1.389  101004
..      ...     ...
995  16.655  132483
996  19.675   42392
997   1.421   96914
998  11.985   60500
999  10.169  129949

[1000 rows x 2 columns]

In [47]:
f_data.columns

Index(['First_Name', 'Gender', 'Strat_Date', 'Last_Login_Time', 'Salary',
       'Bonas', 'Senior_Management', 'Team'],
      dtype='object')

In [62]:
del f_data['Bonas']

In [69]:
f_data['Senior_Management']

0       True
1       True
2      False
3       True
4       True
       ...
995    False
996    False
997    False
998    False
999     True
Name: Senior_Management, Length: 1000, dtype: object

In [64]:
f_data.columns

Index(['First_Name', 'Gender', 'Strat_Date', 'Last_Login_Time', 'Salary',
       'Senior_Management', 'Team'],
      dtype='object')

In [71]:
del f_data['Senior_Management']

KeyError: 'Senior_Management'

In [74]:
del f_data['Salary']

In [33]:
con=pyodbc.connect(dsn='Test')
close()

In [34]:
con

In [75]:
cnxn = pyodbc.connect('DRIVER={SQL Server};SERVER=DESKTOP-3407HKD;DATABASE=pythondata')
cursor = cnxn.cursor()

In [58]:
cnxn

In [78]:
for i ,row in f_data.iterrows():
    cnxn.execute("insert into Employees(First_Name , Gender , Strat_Date , Last_Login_Time , Team ) values(?,?,?,?,?)",
                row.First_Name , row.Gender , row.Strat_Date , row.Last_Login_Time , row.Team)
    cnxn.commit()

ProgrammingError: ('42000', '[42000] [Microsoft][ODBC SQL Server Driver][SQL Server]The incoming tabular data stream (TDS) remote procedure call (RPC) protocol stream is incorrect. Parameter 8 (""): The supplied value is not a valid instance of data type float. Check the source data for invalid values. An example of an invalid value is data of numeric type with scale greater than precision. (8023) (SQLExecDirectW)')

In [77]:
f_data.columns

Index(['First_Name', 'Gender', 'Strat_Date', 'Last_Login_Time', 'Team'], dtype='object')